{
  "name": "UCO Bank - Bagdia Branch",
  "address": "\n4R57+2F2, Bagdia, Odisha 759141",
  "rating": "3.9 stars",
  "pincode": "759141",
  "reviews": [
    {
      "reviewer": "sandeep kumar majhi",
      "rating": "5 stars",
      "date": "7 years ago",
      "text": "UCO Bank, formerly United Commercial Bank, established in 1943 in Kolkata, is a major government-owned commercial bank of India. During FY 2013-14, its total business was ₹ 4.55 lakh crore. Based on 2014 data, it is ranked 1860 on Forbes Global 2000 List. UCO Bank was ranked 294th among India's most trusted brands according to the Brand Trust Report 2014, a study conducted by Trust Research Advisory.[2] It was a rise of 796 ranks considering it was listed at the 1090th position among India's most trusted brands in the Brand trust Report 2013.[3] As of 30 March 2017 the bank had 4,000 plus service units 49 zonal offices spread all over India. It also has two overseas branches in Singapore and Hong Kong. UCO Bank's headquarters is on BTM Sarani, Kolkata.\nOrganisation Structure\nHeadquartered in Kolkata, the Bank has 42 Zonal Offices spread all over India. Branches located in a geographical area report to the Zonal Office having jurisdiction over that area. These Zonal Offices are headed by Senior Executives ranging upto the rank of Deputy General Manager, depending on size of business and importance of location. The Zonal Offices report to 8 Circle Offices headed by General Managers/senior Deputy General Managers.\nOur Commitment to Customers\nIn all our promotional activities, we will be fair and reasonable in highlighting the salient features of the schemes marketed by us. Misleading or unfair highlighting of any aspect of any scheme/service marketed by the Bank leading to unfair practice shall not be resorted to by the Bank.\nIn commemorating the 50th Year of Independence of India, the Bank released a booklet entitled \"Our Commitment to Customers\" incorporating the Citizens’ Charter on services provided by the Bank.\nIn our continuing endeavour to serve our customers better, we have considerably extended the business hours for public transaction at the branches on all week-days.",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "AMIT WITH YOU",
      "rating": "2 stars",
      "date": "a year ago",
      "text": "It's not a friendly bank,there all staff are talking rudely",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "Bhabanishankar Nath",
      "rating": "1 star",
      "date": "2 years ago",
      "text": "Useless branch UCO bagdia ... They don't have manners for customer... They can't work properly...one person a handicapped employee is a useless...",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "Dark Villain",
      "rating": "4 stars",
      "date": "2 years ago",
      "text": "My home",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "Tapan kumar Sahu",
      "rating": "5 stars",
      "date": "7 years ago",
      "text": "Good in all bank",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "PRADHAN SIPU",
      "rating": "5 stars",
      "date": "5 months ago",
      "text": "No review text found",
      "bank_response": "No response from bank"
    },
    {
      "reviewer": "Sunil Biswal",
      "rating": "5 stars",
      "date": "6 years ago",
      "text": "No review text found",
      "bank_response": "No response from bank"
    }
  ],
  "url": "https://www.google.com/maps/place/UCO+Bank+-+Bagdia+Branch/data=!4m7!3m6!1s0x3a21f98049c5b241:0xe36ae3e7c32605be!8m2!3d21.1075155!4d84.8136324!16s%2Fg%2F11f1p2k3tk!19sChIJQbLFSYD5IToRvgUmw-fjauM?authuser=0&hl=en&rclk=1",
  "source_file": "uco_bank_odisha.json"
}